export const ERRMSG = {
  E0001: '指定されたユーザーIDまたはパスワードが正しくありません。',
  E0002:
    '処理が失敗しました。再度実行してください。 再度実行しても解消しない場合はシステム管理者に連絡してください。',
  E0003: '必須項目が空であるか、入力が無効です。',
  E0004: 'Endpoint Error!',
  E0005: '既定値に戻す',
  E0006:
    '変更したデータは他のユーザーに更新されています。 \n 再検索してからもう一度更新を行なって下さい。',
  E0007: 'File Path Error!',
  E0008: '重複データ',
  E0009: '必須入力です',
  E0010: '必須項目が空である',
  E0011: 'この指示は中止されているため、製造を実施できません。',
  E0012: '重複データがデータベースに入力されているため、更新できません。',
  E0013: '未入力項目があります。確認してください。',
  E0014: '同一品目で、異なるロットは使用できません。',
  E0015: 'マイナス入力不可',
  E0016: '在庫数より大きい値を入力できません。',
  E0017: '70日を超える日数は入力できません',
};

export const WARNMSG = {
  W0001: '該当データがありません。',
  W0002:'外注製造については、外注受入ボタンを\n 押してください。',
  W0003:'明細にフォーカスを当てた状態で、\n 再度ボタンを押下してください。',
  W0004:'前の作業が完了していないため、開始できません。',
  W0005:'未入力項目があります。確認してください。',
  W0006:'同一の現品ラベルは登録できません。',
  W0007:'社内製造については、製造実施ボタンを\n 押してください。',
};

export const CONFIRMMSG = {
  C0001: 'データが変更されています。\n 保存しますか?',
  C0002: '削除します。よろしいですか？',
  C0003: 'データが変更されています。\n リセットします。よろしいですか？',
  C0004: '選択したものを削除します。よろしいですか？',
  C0005: '選択したデータを確定します。\nよろしいですか？',
  C0006: '作業を中断します。よろしいですか？',
  C0007: '中断を解除し、作業を再開します。よろしいですか？',
  C0008: '休憩を開始します。よろしいですか？',
  C0009: '休憩を終了いたします。よろしいですか？',
  C0010: '前段取りを開始します。よろしいですか？',
  C0011: '製造を開始します。よろしいですか？',
  C0012: '作業を引き継ぎます。よろしいですか？',
  C0013: '後段取りを終了いたします。よろしいですか？',
  C0014: '開始を取り消すと、これまでの作業実績が削除されます。本当によろしいですか？',
  C0015: '製造実績を修正します。よろしいですか？',
  C0016: '製造を終了します。よろしいですか？',
  C0017: '他の担当者に引継ぎます。よろしいですか？',
  C0018: '製造を中断します。よろしいですか？',
  C0019: '選択したデータを承認します。\nよろしいですか？',
  C0020: '実績を登録します。\nよろしいですか？',
};

export const SUCCESSMSG = {
  S0001: '更新が完了しました。',
  S0002: '印刷が完了しました。',
  S0003: 'プレビューが成功しました。',
  S0004: 'MRP処理が完了しました。',
};

export const INFOMSG = {
  I0001: 'データが存在しません。',
  I0002: '変更は行われませんでした。',
};
