export const ERRMSG = {
  E0001: 'ユーザーIDとパスワード は必須入力です。',
  E0002: 'ユーザーIDは必須入力です。',
  E0003: 'パスワードは必須入力です。',
  E0004: '指定されたユーザーIDまたはパスワードが正しくありません。',
  E0005:
    '処理が失敗しました。再度実行してください。 再度実行しても解消しない場合はシステム管理者に連絡してください。',
  E0006: '品目コードは必須入力です。',
  E0007: 'データテーブルの必須項目が空です。',
  E0008: 'Session Expired!',
  E0009: 'Endpoint Error!',
  E0010: '既定値に戻す',
};

export const WARNMSG = {
  W0001: '該当データがありません。',
};

export const CONFIRMMSG = {
  C0001: 'Do you want to reset the data?',
  C0002: 'データが変更されています。\n 保存しますか?',
  C0003: '削除します。よろしいですか？',
  C0004: 'データが変更されています。\n リセットします。よろしいですか？',
};

export const SUCCESSMSG = {
  S0001: 'DB反映しました。',
};

export const INFOMSG = {
  I0001: 'データが存在しません。',
  I0002: '変更は行われませんでした。',
};
